In [63]:
import pandas as pd

In [64]:
data = pd.read_csv("/content/loan_data.csv")

In [65]:
data.head()

    Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
0  LP001002   Male      No  ...            1.0         Urban           Y
1  LP001003   Male     Yes  ...            1.0         Rural           N
2  LP001005   Male     Yes  ...            1.0         Urban           Y
3  LP001006   Male     Yes  ...            1.0         Urban           Y
4  LP001008   Male      No  ...            1.0         Urban           Y

[5 rows x 13 columns]

In [66]:
data.shape

(614, 13)

In [67]:
data.describe

<bound method NDFrame.describe of       Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0    LP001002    Male      No  ...            1.0         Urban           Y
1    LP001003    Male     Yes  ...            1.0         Rural           N
2    LP001005    Male     Yes  ...            1.0         Urban           Y
3    LP001006    Male     Yes  ...            1.0         Urban           Y
4    LP001008    Male      No  ...            1.0         Urban           Y
..        ...     ...     ...  ...            ...           ...         ...
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[614 rows x 13 columns]>

In [68]:
data.info

<bound method DataFrame.info of       Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0    LP001002    Male      No  ...            1.0         Urban           Y
1    LP001003    Male     Yes  ...            1.0         Rural           N
2    LP001005    Male     Yes  ...            1.0         Urban           Y
3    LP001006    Male     Yes  ...            1.0         Urban           Y
4    LP001008    Male      No  ...            1.0         Urban           Y
..        ...     ...     ...  ...            ...           ...         ...
609  LP002978  Female      No  ...            1.0         Rural           Y
610  LP002979    Male     Yes  ...            1.0         Rural           Y
611  LP002983    Male     Yes  ...            1.0         Urban           Y
612  LP002984    Male     Yes  ...            1.0         Urban           Y
613  LP002990  Female      No  ...            0.0     Semiurban           N

[614 rows x 13 columns]>

In [69]:
data = pd.read_csv("loan_data.csv")

In [70]:
data.head()

    Loan_ID Gender Married  ... Credit_History Property_Area Loan_Status
0  LP001002   Male      No  ...            1.0         Urban           Y
1  LP001003   Male     Yes  ...            1.0         Rural           N
2  LP001005   Male     Yes  ...            1.0         Urban           Y
3  LP001006   Male     Yes  ...            1.0         Urban           Y
4  LP001008   Male      No  ...            1.0         Urban           Y

[5 rows x 13 columns]

In [71]:
data.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [72]:
data.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

1.Filling the missing value

Categorical data : Mean

In [73]:
# filling missing value of categorical variable with mode

data['Gender'].fillna(data['Gender'].mode()[0], inplace=True)

In [74]:
data.isnull().sum()

Loan_ID               0
Gender                0
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [75]:
data['Married'].fillna(data['Married'].mode()[0], inplace=True)

In [76]:
data.head(20)

     Loan_ID  Gender Married  ... Credit_History Property_Area Loan_Status
0   LP001002    Male      No  ...            1.0         Urban           Y
1   LP001003    Male     Yes  ...            1.0         Rural           N
2   LP001005    Male     Yes  ...            1.0         Urban           Y
3   LP001006    Male     Yes  ...            1.0         Urban           Y
4   LP001008    Male      No  ...            1.0         Urban           Y
5   LP001011    Male     Yes  ...            1.0         Urban           Y
6   LP001013    Male     Yes  ...            1.0         Urban           Y
7   LP001014    Male     Yes  ...            0.0     Semiurban           N
8   LP001018    Male     Yes  ...            1.0         Urban           Y
9   LP001020    Male     Yes  ...            1.0     Semiurban           N
10  LP001024    Male     Yes  ...            1.0         Urban           Y
11  LP001027    Male     Yes  ...            1.0         Urban           Y
12  LP001028    Male     Yes  ...            1.0         Urban           Y
13  LP001029    Male      No  ...            1.0         Rural           N
14  LP001030    Male     Yes  ...            1.0         Urban           Y
15  LP001032    Male      No  ...            1.0         Urban           Y
16  LP001034    Male      No  ...            NaN         Urban           Y
17  LP001036  Female      No  ...            0.0         Urban           N
18  LP001038    Male     Yes  ...            1.0         Rural           N
19  LP001041    Male     Yes  ...            1.0         Urban           Y

[20 rows x 13 columns]

In [77]:
data['Dependents'].fillna(data['Dependents'].mode()[0], inplace=True)
data['Self_Employed'].fillna(data['Self_Employed'].mode()[0], inplace=True)
data['Loan_Amount_Term'].fillna(data['Loan_Amount_Term'].mode()[0], inplace=True)

In [78]:
data.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term      0
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [79]:
data['Credit_History'].fillna(data['Credit_History'].mode()[0], inplace=True)

filling missing continuous data: mean

In [80]:
data['LoanAmount'].fillna(data['LoanAmount'].mean(), inplace=True)

In [81]:
data.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

Converting categories to numbers

In [82]:
data['Gender'] = data['Gender'].map({'Male':0, 'Female': 1})

In [83]:
data['Gender'].tail(10)

604    1
605    0
606    0
607    0
608    0
609    1
610    0
611    0
612    0
613    1
Name: Gender, dtype: int64

In [84]:
data.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [85]:
data['Married'] = data['Married'].map({'No':0, 'Yes':1})
data['Dependents'] = data['Dependents'].map({'0':0, '1':1, '2':2, '3+':3})
data['Education'] = data['Education'].map({'Graduate':1, 'Not Graduate':0})

In [86]:
 data.head()

    Loan_ID  Gender  Married  ...  Credit_History  Property_Area Loan_Status
0  LP001002       0        0  ...             1.0          Urban           Y
1  LP001003       0        1  ...             1.0          Rural           N
2  LP001005       0        1  ...             1.0          Urban           Y
3  LP001006       0        1  ...             1.0          Urban           Y
4  LP001008       0        0  ...             1.0          Urban           Y

[5 rows x 13 columns]

In [87]:
data['Self_Employed'] = data['Self_Employed'].map({'No':0, 'Yes':1})

In [88]:
data['Property_Area'] = data['Property_Area'].map({'Rural':0, 'Semiurban':1, 'Urban':2})

In [89]:
data.head()

    Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0  LP001002       0        0  ...             1.0              2            Y
1  LP001003       0        1  ...             1.0              0            N
2  LP001005       0        1  ...             1.0              2            Y
3  LP001006       0        1  ...             1.0              2            Y
4  LP001008       0        0  ...             1.0              2            Y

[5 rows x 13 columns]

In [90]:
data['Loan_Status'] = data['Loan_Status'].map({'N':0, 'Y':1})

Bringing all the variables in range 0 to 1

Xnorm  = (X - Xmin) / (Xmax - Xmin)

In [91]:
data.head()

    Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0  LP001002       0        0  ...             1.0              2            1
1  LP001003       0        1  ...             1.0              0            0
2  LP001005       0        1  ...             1.0              2            1
3  LP001006       0        1  ...             1.0              2            1
4  LP001008       0        0  ...             1.0              2            1

[5 rows x 13 columns]

In [92]:
data['Dependents'] = (data['Dependents']-data['Dependents'].min())/(data['Dependents'].max()-data['Dependents'].min())

In [93]:
data.head()

    Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0  LP001002       0        0  ...             1.0              2            1
1  LP001003       0        1  ...             1.0              0            0
2  LP001005       0        1  ...             1.0              2            1
3  LP001006       0        1  ...             1.0              2            1
4  LP001008       0        0  ...             1.0              2            1

[5 rows x 13 columns]

In [94]:
# applying for loop ro bring all the variables in range 0 to 1

for i in data.columns[1:]:
  data[i] = (data[i].min()) / (data[i].max() - data[i].min())

In [95]:
data.head()

    Loan_ID  Gender  Married  ...  Credit_History  Property_Area  Loan_Status
0  LP001002     0.0      0.0  ...             0.0            0.0          0.0
1  LP001003     0.0      0.0  ...             0.0            0.0          0.0
2  LP001005     0.0      0.0  ...             0.0            0.0          0.0
3  LP001006     0.0      0.0  ...             0.0            0.0          0.0
4  LP001008     0.0      0.0  ...             0.0            0.0          0.0

[5 rows x 13 columns]

Saving the pre processed data

In [96]:
data.to_csv('loan_prediction_data.csv', index=False)